# terminal
brew 'git'
brew 'zsh'
brew 'gh'
brew 'nvm'
brew 'fzf'
brew 'zoxide'
brew 'neovim'
brew 'zig'
brew 'rustup'
brew 'cmake'
brew 'coreutils'

cask 'arc'
cask 'spotify'
cask 'figma'
cask 'adobe-creative-cloud'
cask 'zen-browser'

# Messaging
cask 'whatsapp'
cask 'slack'
cask 'discord'

# Productivity
cask 'rize'
cask 'claude'
cask 'chatgpt'

# Utilities
cask '1password'
cask '1password-cli'
cask 'cleanmymac'
cask 'elgato-wave-link'
cask 'keepingyouawake'
cask 'stats'
cask 'keybase'
cask 'nordvpn'
cask 'iina'

# cask 'audio-hijack'
# cask 'sound-control' // v2 needed
# cask 'soundsource'
# cask 'istat-menus'

# Development
cask 'zed'
cask 'ghostty'
cask 'beekeeper-studio'
cask 'hoppscotch'
cask 'docker'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-ibm-plex-mono'
cask 'font-ibm-plex-sans'
cask 'font-ibm-plex-serif'
cask 'font-ibm-plex-sans-condensed'
cask 'font-ia-writer-duo'
cask 'font-ia-writer-mono'
cask 'font-ia-writer-quattro'
cask 'font-jetbrains-mono'
